#  Create  DataFrame using Python

In [1]:
import pandas as pd

In [2]:
# Create empty Dataframe 
empty_dataframe = pd.DataFrame()
print(empty_dataframe)

Empty DataFrame
Columns: []
Index: []

In [3]:
# LIST
lst_01 = ['a(A)','b(B)','c(C)','d(D)','e(E)']
print(lst_01)

['a(A)', 'b(B)', 'c(C)', 'd(D)', 'e(E)']

In [4]:
dataframe_01 = pd.DataFrame(lst_01)

In [5]:
# Using print command to print
print(dataframe_01)

      0
0  a(A)
1  b(B)
2  c(C)
3  d(D)
4  e(E)

In [6]:
# Another way to print only jupyter
dataframe_01

      0
0  a(A)
1  b(B)
2  c(C)
3  d(D)
4  e(E)

In [7]:
# list of List Creation
list_02 = [[1,2,3,4],[11,12,13,14],[111,122,123,124]]
# printing of list 
list_02

[[1, 2, 3, 4], [11, 12, 13, 14], [111, 122, 123, 124]]

In [8]:
# print of DataFrame
dataframe_02 = pd.DataFrame(list_02)
dataframe_02

     0    1    2    3
0    1    2    3    4
1   11   12   13   14
2  111  122  123  124

In [9]:
# Creation Dictionary
dict_01 = {"ID":[1001,1002,1003,1004,1005]}
dict_01

{'ID': [1001, 1002, 1003, 1004, 1005]}

In [10]:
dataframe_03 = pd.DataFrame(dict_01)
dataframe_03

     ID
0  1001
1  1002
2  1003
3  1004
4  1005

In [11]:
# Creation Multiple Dictionary
# Both value must be eqaul in size
dict_02 = {"ID":[5001,5002,5003,5004,5005], " Gender":['M','F','F','M','M']}
dict_02

{'ID': [5001, 5002, 5003, 5004, 5005], ' Gender': ['M', 'F', 'F', 'M', 'M']}

In [12]:
dataframe_04 = pd.DataFrame(dict_02)
dataframe_04

     ID  Gender
0  5001       M
1  5002       F
2  5003       F
3  5004       M
4  5005       M

In [13]:
# List of Dictionary - Mistake***
dict_03 = [{"Sr No.": [9001,9002,90003,9004,9005], "Id":['1','2','3','4','5']}, {"Name":["Aviral", "Ram\n", "Riya", "Siya", "Sam"],"Gender": ['M','M','F','F','M']}, {"Age": ['23','21','23','24','20']}]
dict_03

[{'Sr No.': [9001, 9002, 90003, 9004, 9005], 'Id': ['1', '2', '3', '4', '5']},
 {'Name': ['Aviral', 'Ram\n', 'Riya', 'Siya', 'Sam'],
  'Gender': ['M', 'M', 'F', 'F', 'M']},
 {'Age': ['23', '21', '23', '24', '20']}]

In [14]:
# List of dictionary - DataFrame
dataframe_05 = pd.DataFrame(dict_03)
dataframe_05

,Sr No.,Id,Name,Gender,Age
0,"[9001, 9002, 90003, 9004, 9005]","[1, 2, 3, 4, 5]",NaN,NaN,NaN
1,NaN,NaN,"[Aviral, Ram\n, Riya, Siya, Sam]","[M, M, F, F, M]",NaN
2,NaN,NaN,NaN,NaN,"[23, 21, 23, 24, 20]"

In [15]:
# List of Dictionary - Mistake***
dict_03 = {"Aviral" : [9001,1,'M'], "Ram":[9002,2,'M'], "Riya":[9003,3,'F']}
dict_03

{'Aviral': [9001, 1, 'M'], 'Ram': [9002, 2, 'M'], 'Riya': [9003, 3, 'F']}

In [16]:
dataframe_06 = pd.DataFrame(dict_03)
dataframe_06

  Aviral   Ram  Riya
0   9001  9002  9003
1      1     2     3
2      M     M     F

In [19]:
# Dictionary Series creation - Data Frame
dict_list = {"ID":pd.Series([1,2,3]), "Gender":pd.Series(['M','F','M'])}
dict_list_print = pd.DataFrame(dict_list)
dict_list_print

   ID Gender
0   1      M
1   2      F
2   3      M

In [ ]:
# tuple or other methods
#